# Exploratory Data Analysis #

## Set up imports for Pandas, Matplotlib, and MySQL Connector ##

In [55]:
import pandas as pd
import matplotlib.pyplot as plt
import mysql.connector as connection

## Use MySQL Connector to establish a connection to my remote data source ##

In [56]:
myremotedb = connection.connect(host = "devcodecamp-mysql.c5p7yvjq1h8y.us-east-2.rds.amazonaws.com", database = "salesdb", user = "root", password = "D3v$tudent", use_pure = True)

## Query **salesdb** to JOIN the information from the *sales* and *cities* tables and save as a single data frame ##

In [57]:
joinquery = """SELECT sales.Invoice_ID,
                    sales.Customer_Type,
                    sales.Gender,
                    sales.Product_Line,
                    sales.Unit_Price,
                    sales.Quantity,
                    sales.Sales_Tax,
                    sales.Total,
                    sales.Date,
                    sales.Time,
                    sales.Payment,
                    sales.COGS,
                    sales.Gross_Income,
                    sales.rating,
                    cities.City 
                    FROM sales 
                    JOIN cities 
                    ON sales.City_ID = cities.City_ID"""
joined_df = pd.read_sql_query(joinquery, myremotedb)

C:\Users\Owner\AppData\Local\Temp\ipykernel_13220\873594371.py:19: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  joined_df = pd.read_sql_query(joinquery, myremotedb)

## Perform necessary data cleaning and wrangling steps on Joined DataFrame ##

* Explore all the `values` within all the `columns` of the new *Joined DataFrame*

In [58]:
joined_df.head()

,Invoice_ID,Customer_Type,Gender,Product_Line,Unit_Price,Quantity,Sales_Tax,Total,Date,Time,Payment,COGS,Gross_Income,rating,City
0,101-17-6199,Normal,Male,Food and beverages,45.79,7,None,336.5565,3/13/2019,19:44,Credit card,320.53,16.0265,7.0,Seattle
1,101-81-4070,Member,Female,Health and beauty,62.82,2,None,131.9220,1/17/2019,12:36,Ewallet,125.64,6.2820,4.9,Milwaukee
2,102-06-2002,Member,Male,Sports and travel,25.25,5,None,132.5625,3/20/2019,17:52,Cash,126.25,6.3125,6.1,Milwaukee
3,102-77-2261,Member,Male,Health and beauty,65.31,7,None,480.0285,3/5/2019,18:02,Credit card,457.17,22.8585,4.2,Milwaukee
4,105-10-6182,Member,Male,Fashion accessories,21.48,2,None,45.1080,2/27/2019,12:22,Ewallet,42.96,2.1480,6.6,Seattle

* Check for/drop null `values` from *Joined DataFrame*

In [59]:

no_null_df = joined_df.drop("Sales_Tax", axis =1)
no_null_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 14 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Invoice_ID     1000 non-null   object
 1   Customer_Type  1000 non-null   object
 2   Gender         1000 non-null   object
 3   Product_Line   1000 non-null   object
 4   Unit_Price     1000 non-null   float64
 5   Quantity       1000 non-null   int64
 6   Total          1000 non-null   float64
 7   Date           1000 non-null   object
 8   Time           1000 non-null   object
 9   Payment        1000 non-null   object
 10  COGS           1000 non-null   float64
 11  Gross_Income   1000 non-null   float64
 12  rating         1000 non-null   float64
 13  City           1000 non-null   object
dtypes: float64(5), int64(1), object(8)
memory usage: 109.5+ KB

`Sales_Tax column removed`

* Check for duplicate `rows` from the *No Null DataFrame*

In [60]:
no_null_df.duplicated().sort_values

<bound method Series.sort_values of 0      False
1      False
2      False
3      False
4      False
       ...
995    False
996    False
997    False
998    False
999    False
Length: 1000, dtype: bool>

`No duplicate rows to delete`

* Convert any necessary `values` to *Panda DateTime* format within `columns` of the *No Null DataFrame*

In [61]:
no_null_df["Date"] = pd.to_datetime(no_null_df["Date"])
# no_null_df["Time"] = pd.to_datetime(no_null_df["Time"])
no_null_df['Time'] = pd.to_datetime(no_null_df['Time']).dt.time
no_null_df.head()

,Invoice_ID,Customer_Type,Gender,Product_Line,Unit_Price,Quantity,Total,Date,Time,Payment,COGS,Gross_Income,rating,City
0,101-17-6199,Normal,Male,Food and beverages,45.79,7,336.5565,2019-03-13,19:44:00,Credit card,320.53,16.0265,7.0,Seattle
1,101-81-4070,Member,Female,Health and beauty,62.82,2,131.9220,2019-01-17,12:36:00,Ewallet,125.64,6.2820,4.9,Milwaukee
2,102-06-2002,Member,Male,Sports and travel,25.25,5,132.5625,2019-03-20,17:52:00,Cash,126.25,6.3125,6.1,Milwaukee
3,102-77-2261,Member,Male,Health and beauty,65.31,7,480.0285,2019-03-05,18:02:00,Credit card,457.17,22.8585,4.2,Milwaukee
4,105-10-6182,Member,Male,Fashion accessories,21.48,2,45.1080,2019-02-27,12:22:00,Ewallet,42.96,2.1480,6.6,Seattle

`Date and Time columns converted to Panda DateTime format`

#### Create a `variable` that redefines the final filtered *DataFrame*

In [62]:
main_df = no_null_df
main_df.head()

,Invoice_ID,Customer_Type,Gender,Product_Line,Unit_Price,Quantity,Total,Date,Time,Payment,COGS,Gross_Income,rating,City
0,101-17-6199,Normal,Male,Food and beverages,45.79,7,336.5565,2019-03-13,19:44:00,Credit card,320.53,16.0265,7.0,Seattle
1,101-81-4070,Member,Female,Health and beauty,62.82,2,131.9220,2019-01-17,12:36:00,Ewallet,125.64,6.2820,4.9,Milwaukee
2,102-06-2002,Member,Male,Sports and travel,25.25,5,132.5625,2019-03-20,17:52:00,Cash,126.25,6.3125,6.1,Milwaukee
3,102-77-2261,Member,Male,Health and beauty,65.31,7,480.0285,2019-03-05,18:02:00,Credit card,457.17,22.8585,4.2,Milwaukee
4,105-10-6182,Member,Male,Fashion accessories,21.48,2,45.1080,2019-02-27,12:22:00,Ewallet,42.96,2.1480,6.6,Seattle

## Examine the Spread of `values` across `columns` within `Filtered DataFrame` ##

* How many sales were made for members vs. normal customers

In [65]:
customer_compariso_query = "SELECT Customer_type, SUM(Total) as Total_Sum FROM sales GROUP BY Customer_type ORDER BY Total_Sum"
customer_comparison = pd.read_sql(customer_compariso_query, myremotedb)
customer_comparison

C:\Users\Owner\AppData\Local\Temp\ipykernel_13220\1223648179.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  customer_comparison = pd.read_sql(customer_compariso_query, myremotedb)

  Customer_type   Total_Sum
0        Normal  158743.305
1        Member  164223.444

* How many sales were made at each store location

* How many sales were made for each product line

* What is the overall average rating, based on all sales records